1. 
计算机的工作原理
	冯.诺依曼原理(指令、数据、内存)
	冯·诺依曼结构(硬件系统、软件系统)
	指令(程序、CPU)
	硬件(运算器、控制器、存储器、输入和输入设备)
		中央处理器(CPU): 控制器 + 寄存器 + 运算器   芯片   	微处理器
		控制器: 指令寄存器 + 状态寄存器 + 指令译码器 + 时序电路 + 控制电路  微命令
		运算器(算术逻辑单元ALU): 加法器 + 寄存器
		存储器: 内存 + 外存储器
			半导体存储器: 随机存储器、只读存储器、特殊存储器
			位/比特（bit）(晶体管) 
			字节（Byte） 千字节(Kilo) 兆字节(Mega)  吉字节(Giga)  太字节(Tera)  PB
		输入输出设备
			键盘、鼠标、扫描仪、光笔
			显示器、打印机、绘图仪
		总线:  系统部件  数据传送 公用信号线
	技术指标
		CPU类型		芯片型号
		字长	64 32
		主频	兆（MHz）	CPU晶振频率
		运算速度	每秒执行指令数
		存取速度
		内、外存储器容量
	操作系统: 操作硬件	文件管理
	软件系统: 通过操作系统来传递信息
vue-cli热更新: 修改代码保存后, 页面更新


从0开始搭建vue-cli框架

webpack-dev-server
2. 编程的实质
3. application/json
4. get/post请求
5. mock.js
6. bqm-tools之import，export